var github = 'https://github.com/NEXTkuk';
var linkedin = 'https://www.linkedin.com/in/antonbuynov/';

help = [
  '+========================================================================================+',
  '| Commands   | Descriptions                                                              |',
  '+========================================================================================+',
  '| whois      | Who is Anton Buynov?                                                      |',
  '| social     | Display Social Networks                                                   |',
  '| history    | View command history                                                      |',
  '| help       | FAQ                                                                       |',
  '| clear      | Clear terminal                                                            |',
  '| banner     | Display the header                                                        |',
  '| GitHub     | Discover more projects on my GitHub profile                               |',
  '+========================================================================================+',
];

banner = [
  '░█████╗░███╗░░██╗████████╗░█████╗░███╗░░██╗  ██████╗░██╗░░░██╗██╗░░░██╗███╗░░██╗░█████╗░██╗░░░██╗',
  '██╔══██╗████╗░██║╚══██╔══╝██╔══██╗████╗░██║  ██╔══██╗██║░░░██║╚██╗░██╔╝████╗░██║██╔══██╗██║░░░██║',
  '███████║██╔██╗██║░░░██║░░░██║░░██║██╔██╗██║  ██████╦╝██║░░░██║░╚████╔╝░██╔██╗██║██║░░██║╚██╗░██╔╝',
  '██╔══██║██║╚████║░░░██║░░░██║░░██║██║╚████║  ██╔══██╗██║░░░██║░░╚██╔╝░░██║╚████║██║░░██║░╚████╔╝░',
  '██║░░██║██║░╚███║░░░██║░░░╚█████╔╝██║░╚███║  ██████╦╝╚██████╔╝░░░██║░░░██║░╚███║╚█████╔╝░░╚██╔╝░░',
  '╚═╝░░╚═╝╚═╝░░╚══╝░░░╚═╝░░░░╚════╝░╚═╝░░╚══╝  ╚═════╝░░╚═════╝░░░░╚═╝░░░╚═╝░░╚══╝░╚════╝░░░░╚═╝░░░',
  '                                                                                                 ',
];

whois = [
  '<br>',
  'Welcome to AB Terminal, I\'m <span class="command">Anton</span>!😎',
  '<br>',
  '- I am continuously working to hone my skills and achieve my goal of becoming a full-fledged <span class="command">Frontend developer</span>.',
  '<br>',
];

social = [
  '<br>',
  '<span class="command">LinkedIn</span>       <a href="' +
    linkedin +
    '" target="_blank">LinkedIn/antonbuynov' +
    '</a>',
  '<span class="command">GitHub</span>         <a href="' + github + '" target="_blank">GitHub/NEXTkuk' + '</a>',
  '<br>',
];

suggestion = [
  '<p class>',
  '<span class="color2">Welcome!<br>For a list of available commands, type <span class="command">help</span>.',
  '</span>',
  '</p>',
];

secret = ['<br>', '<span class="command">hack</span>       Only admin can type this command', '<br>'];
